Repository: kvn777/OppositionGameBot
Catalog: lang/*/LC_MESSAGES/messages.po
Languages: ru

source: Government Agent
ru: Агент Правительства

source: Opposition Member
ru: Член Оппозиции

source: Opposition Leader
ru: Лидер Оппозиции

source: Prosecutor
ru: Прокурор

source: Bodyguard
ru: Телохранитель

source: Secret Agent
ru: Тайный Агент

# bot_intro_chat_message
source: Welcome to the game Opposition! Request game rules /rules (clickable and you can ask the rules in the bot's private message). First of all, all participants should start a dialog with the bot @OppositionGameBot (click on the bot's name, open the dialog and press Start), so that the bot can send you messages. Create a chat room (or use an existing chat room), add the bot to the chat room. Create a video conference between players (Telegram, Google or Discord whatever), have the chat administrator send /start to the chat - and I'll distribute the roles and do the necessary voting. You need five to 15 people to play.
ru: Добро пожаловать в игру Оппозиция! Запросить правила игры /rules (кликабельно и можно спросить правила в личке у бота). Прежде всего все участники должны начать диалог с ботом @OppositionGameBot (нажмите на имя бота, откройте диалог и нажмите "Start") что бы бот мог вам отправлять сообщения. Создайте чат (или используйте существующий чат), добавьте бота в чат. Создайте видеоконференцию между игроками (в Telegram, Google или Discord без разницы), администратор чата пусть отправит в чат /start - а я раздам роли и буду проводить необходимые голосования. Для игры нужно от 5 до 15 человек.

# bot_intro_user_message
source: Welcome to the game Opposition! Request game rules /rules (clickable and you can ask the rules in the bot's private message). Create a chat room (or use an existing chat room), add the bot to the chat room. First of all, all participants should start a dialog with the bot @OppositionGameBot (click on the bot's name, open the dialog and press Start), so that the bot can send you messages. Create a video conference between players (Telegram, Google or Discord whatever), have the chat administrator send /start to the chat - and I'll distribute the roles and do the necessary voting. You need five to 15 people to play.
ru: Добро пожаловать в игру Оппозиция! Запросить правила игры /rules (кликабельно и можно спросить правила в личке у бота). Прежде всего все участники должны начать диалог с ботом @OppositionGameBot (нажмите на имя бота, откройте диалог и нажмите "Start") что бы бот мог вам отправлять сообщения. Создайте чат (или используйте существующий чат), добавьте бота в чат. Создайте видеоконференцию между игроками (в Telegram, Google или Discord без разницы), администратор чата пусть отправит в чат /start - а я раздам роли и буду проводить необходимые голосования. Для игры нужно от 5 до 15 человек.

# rules_about_bot_message
source: Welcome to the game Opposition! Request game rules /rules (clickable and you can ask the rules in the bot's private message). First of all, all participants should start a dialog with the bot @OppositionGameBot (click on the bot's name, open the dialog and press Start), so that the bot can send you messages. Create a chat room (or use an existing chat room), add the bot to the chat room. Create a video conference between players (Telegram, Google or Discord whatever), have the chat administrator send /start to the chat - and I'll distribute the roles and do the necessary voting
ru: Добро пожаловать в игру Оппозиция! Запросить правила игры /rules (кликабельно и можно спросить правила в личке у бота). Прежде всего все участники должны начать диалог с ботом @OppositionGameBot (нажмите на имя бота, откройте диалог и нажмите "Start") что бы бот мог вам отправлять сообщения. Создайте чат (или используйте существующий чат), добавьте бота в чат. Создайте видеоконференцию между игроками (в Telegram, Google или Discord без разницы), администратор чата пусть отправит в чат /start - а я раздам роли и буду проводить необходимые голосования

# rules_about_game_message
source: Prologue Opposition is a psychological game (one of those games, the familiar Mafia). Players are either the Opposition, led by an Opposition Leader*, whose goal is to overthrow the current government, or they become undercover agents, seeking to foil the Opposition's plans, led by a Prosecutor*. The Opposition wins if they successfully hold three rallies. The victory goes to Government Agents if the 3 rallies are failed. The agents can also win if the Opposition fails to organise a rally team (5 disruptions in the vote for the composition of the rally). In addition, if the Opposition successfully holds three rallies, the Prosecutor arrests one of the Opposition members and if it is the Leader of the Opposition - the Agents of the Government win*. The main thing about this game is that players can express their opinions at any time. Communication, intuitive insights, lying, bluffing, logic, interaction and strategic thinking are essential to winning this game. But please don't correspond in private to keep the game fair and interesting. '* Extra roles are only entered when playing with 7 people or more. Rules of the game. All players are randomly assigned roles (received in their inbox), the roles are divided into Opposition and Government Agents, as the number of players increases, new roles are introduced and new team options become available.Government agents are told (in the private area) the names of other agents (Except in games of 10 or more people, where the role of Secret Agent is added and not revealed to anyone, but acting on behalf of Government Agents)One of the players (either a Government Agent or an Opposition member) is chosen as the rally organiser and chooses the required number of players for the rally (I will write down how many players to choose at what point)All players then discuss the choice of Rally Leader and at the same time publicly vote on whether or not to accept the composition of the team (the voting form will be in the chatroom) If the vote for the rally line-up fails, the turn is passed to the next player and he is appointed Rally Leader, chooses a new rally line-up, etc. If the composition of the rally fails 5 times, the Agents win.If the vote for the rally line-up is successful - an anonymous vote for the rally will be sent to those going to the rally. Opposition members will have no choice but to vote for the rally, while government agents will be allowed to vote both for and against the rally. If there is at least one vote against* the rally, the rally is deemed not to have taken place. (*Except for one mission with a 7-10 person game, where two votes against will be required) If the rally takes place, the Opposition team gets a victory point.If the rally fails, the Agents' team gets a point.Game continues until one team gets 3 points. Roles in the game Up to 7 people in the game are just ordinary Opposition members and ordinary Government Agents. For games with 7 to 9 players, the roles are added: Opposition Leader, who is notified at the start (by the bot in the Personal Line) of all (except Secret Agent) Government Agents and the Prosecutor, who, in case of defeat of the Agents, arrests one of the Opposition members and if it is their Leader - the Agents win. In a game of 10 or more: The Agents get the roles: Provocateur and Secret Agent, the Provocateur's identity becomes known to the Leader's bodyguard and the Secret Agent's identity is not known to anyone.A Bodyguard of the Leader is added to the Opposition team, who is told the identity of the Opposition Leader and Provocateur (without specifying who is who), his goal is to protect the Leader and if the Opposition wins, the Prosecutor will arrest the Bodyguard (as a possible Leader) or another ordinary member of the Opposition.
ru: Пролог Оппозиция — психологическая игра (одна из таких игр, многим знакомая, Мафия). Игроки либо являются Оппозицией, во главе с Лидером Оппозиции*, целью которой является свержение действующего правительства, либо становятся Агентами под прикрытием, стремящимися расстроить планы Оппозиции, во главе с Прокурором*. Оппозиция побеждает если успешно проведет 3 митинга. Победа достается Агентам Правительства, если 3 митинга были провалены. Агенты также могут победить, если Оппозиции не удаётся организовать команду по организации митинга (5 срывов голосования за состав митингующих). Кроме того, если Оппозиция успешно провела три митинга, Прокурор арестовывает одного из участников Оппозиции и если это Лидер Оппозиции - Агенты Правительства побеждают*. Основное в этой игре, это возможность игроков в любое время высказать свое мнение. Общение, интуитивные озарения, ложь, блеф, логика, взаимодействие и стратегическое мышление важны для победы в этой игре. Но пожалуйста не переписывайтесь в личке, чтобы игра была честной и интересной. '* Дополнительные роли вводятся только при игре от 7 человек. Правила игры Всем игрокам в случайном порядке выдаются роли (приходят в личку), роли делятся на участников Оппозиции и Агентов Правительства, с увеличением количества играющих вводятся новые ролии и появляются новые возможности у команд Агентам правительства сообщаются (в личку) имена других агентов (Кроме игры в 10 и более человек где добавляется роль Тайного Агента и он не раскрывается никому, но действует в интересах Агентов Правительства) Один из игроков (либо агент правительства, либо член оппозиции) выбирается в качестве организатора митинга и выбирает необходимое количество игроков для митинга (я буду писать сколько игроков в какой момент нужно выбирать) Затем все игроки обсуждают выбор Руководителя Митинга и одновременно публично голосуют о том, принимать ли состав команды или нет (форма для голосования будет в чате) Если голосование за состав митингующих провалилось - ход передается следующему игроку и он назначается Руководителем Митинга, выбирает новый состав митингующих и т.д. Если голосование за состав митингующих провалилось 5 раз - Агенты выигрывают Если голосование за состав митингующих успешно - в личку тем кто идет на митинг присылается анонимное голосование за проведение митинга. У членов оппозиции не будет выбора, нужно будет проголосовать только за митинг, а агентам правительства можно будет голосовать как за проведение митинга, так и против него. Если будет хотя бы один голос против* митинга - митинг считается не состоявшимся. (* Кроме одной миссии с игрой на 7-10 человек, где нужно будет два голоса против) Если митинг состоялся - записывается очко победы команде Оппозиции Если митинг не состоялся - записывается очко победы команде Агентов Игра продолжается до тех пор, пока одна команда не наберет 3 очка Роли в игре До 7 человек в игре есть только рядовые члены Оппозиции и рядовые Агенты Правительства При игре от 7 до 9 человек, добавляются роли: Лидер Оппозиции, которому на старте сообщаются(бот пишет в личку) все(кроме Тайного Агента) Агенты Правительства и Прокурор, который в случае поражения команды Агентов арестовывает одного из участников Оппозиции и если это будет их Лидер - команда Агентов выигрывает При игре в 10 человек и более: В команду Агентов добавляются роли: Провокатор и Тайный Агент, личность Провокатора становится известна Телохранителю Лидера, а личность Тайного Агента не известна никому В команду Оппозиции добавляется Телохранитель Лидера, которому сообщаются личности Лидера Оппозиции и Провокатора (без указания кто есть кто), его цель защитить Лидера и если Оппозиция выиграет, Прокурор арестовал Телохранителя (как возможного Лидера) или другого рядового члена Оппозиции

# join_game_button_message
source: To join the game, click the button below this message.
ru: Для участия в игре нажмите кнопку под этим сообщением

# join_game_button_text
source: I'm in!
ru: Я в деле!

# start_game_button_message
source: Once enough people have been added, the chat administrator should click the button below.
ru: После того как наберётся достаточное количество игроков, администратору чата нужно нажать кнопку ниже

# start_game_button_text
source: Start Game!
ru: Старт игры!

# vote_meeting_team
source: You need to choose whether or not you agree with this lineup The result of your vote will be posted.
ru: Вам нужно выбрать согласны вы с этим составом или нет Результат вашего голосования будет опубликован.

source: Confirm
ru: ЗА

# vote_meeting_message
source: Only the rally participants vote! You need to choose whether you want to make this rally a success or you want to prevent it.Members of the Opposition always vote FOR, Agents of the Government vote at their discretion. The vote is secret.
ru: Голосуют участники митинга! Вам нужно выбрать успешно провести этот митинг или вы хотите помешать его проведению. члены Оппозиции голосуют всегда ЗА, Агенты Правительства по своему усмотрению. Голосование тайное.

source: Your role:
ru: Ваша роль:

# your_identity_and_OppositionLeader_known_Bodyguard_but
source: Your identity and the Opposition Leader's identity is known to the Bodyguard, but it does not reveal who is who, you can play it to make it think you are the Opposition Leader.
ru: Ваша личность и личность Лидера Оппозиции известна Телохранителю, но не раскрывается кто есть кто конкретно, вы можете сыграть так чтобы он думал что вы Лидер Оппозиции.

# your_mission_find_OppositionLeader_and_arrest
source: Your goal is to find the Opposition Leader and arrest him if your team loses.
ru: Ваша цель выявить Лидера Оппозиции и арестовать его если ваша команда проиграет.

# all_agents_known_OppositionLeader_but
source: All identities of Government Agents are known to the Opposition Leader, except yours, but you also do not know who else is playing for the Government.
ru: Все личности Агентов Правительства известна Лидеру Оппозиции, кроме вашей, но вы так же не знаете кто еще играет за Правительство.

# your_mission_disrupt_3_meetings_sabotage_5_election
source: You are a member of the Agents of Government team, and your goal is to disrupt 3 rallies or sabotage 5 consecutive elections.
ru: Вы член команды Агентов Правительства, ваша цель: сорвать проведение 3 митингов, либо 5 раз подряд саботировать выборы участников митинга.

# agents_in_game:
source: Government agents in this game:
ru: Агенты Правительства в этой игре:

# you_are_OppositionMember_your_mission_but_OppositionLeader
source: You are an Opposition member, your goal is to successfully hold 3 rallies, but if you fail, you must prevent the Agents from revealing and arresting the Opposition Leader or your team will lose.
ru: Вы рядовой член Оппозиции, ваша цель успешно провести 3 митинга, но если вам этого не удастся, нужно не дать Агентам раскрыть и арестовать Лидера Оппозиции, иначе ваша команда проиграет.

# you_are_OppositionMember_your_mission
source: You are an Opposition member, your goal is to successfully hold 3 rallies.
ru: Вы рядовой член Оппозиции, ваша цель успешно провести 3 митинга.

# your_mission_lead_and_not_be_arrested
source: Your goal is to successfully hold 3 rallies and not be exposed if your team loses so the Prosecutor does not arrest you.
ru: Ваша цель успешно провести 3 митинга и не быть раскрытым если ваша команда проиграет, чтобы Прокурор не арестовал вас.

# Leader_and_Provocateur:
source: Opposition Leader and Provocateur in this game (not necessarily in that order):
ru: Лидер Оппозиции и Провокатор в этой игре (не обязательно в таком порядке):

# your_mission_protect_Leader_and_to_be_arrested
source: Your goal is to protect the Leader of the Opposition so the Prosecutor can arrest you or another rank-and-file member of the Opposition.
ru: Ваша цель защитить Лидера Оппозиции, чтобы Прокурор арестовал вас или другого рядового члена опозиции.

# Cant_send_to:
source: Can't send message:
ru: Не могу отправить сообщее:

# pls_start_message_with_bot_PM
source: please start messaging the bot @OppositionGameBot (click on the bot's name, open the dialog, and click "Start")
ru: пожалуйста напишите боту @OppositionGameBot (нажмите на имя бота, откройте диалог и нажмите "Start")

# mission_commander:
source: The rally organiser:
ru: Организатор митинга:

# chose_players_next_meeting
source: You need to choose your choice of protesters, discuss your choices with the game participants, listen to their opinions, state your own, and make your choice:
ru: Вам нужно выбрать участников митинга, обсуждайте свой выбор с участниками игры, послушайте их мнения, выскажите своё и сделайте свой выбор:

# list_of_players:
source: Players:
ru: Игроки:

source: role
ru: Роль

# game_ended_opposition_win
source: Game complete. Opposition wins!
ru: Игра завершена. Выиграла Оппозиция!

source: Round:
ru: Раунд:

# you_r_not_admin_message
source: You are not admin!
ru: Вы не администратор чата!

# max_players_warn
source: The maximum number of participants is reached
ru: Максимальное количество участников набрано

# you_r_not_start_bot_pls_pm_bot
source: You have not started the bot, please email me
ru: Вы не начали общение с ботом, пожалуйста напишите мне в личку

# join_game:
source: Will play:
ru: Будет играть:

# max_players_done_let_game_start
source: The maximum number of players has already registered, let's get started! Click the game start button.
ru: Уже зарегистрировалось максимальное количество игроков, давайте начинать! Нажмите кнопку старта игры.

# you_already_in_game_or_game_started
source: You are already in the game or the game has started without you.
ru: Вы уже в игре или игра началась без вас.

# you_r_start_game
source: You are start the game!
ru: Вы начали игру!

# error_start_game_pls_try_again
source: Game start error, try again later.
ru: Ошибка старта игры, попробуйте позже.

# min_players_warn
source: There is no minimum number of players..
ru: Минимум игроков не набран.

# go_to_mission:
source: Will go to the rally:
ru: Пойдет на митинг:

# u_need_choose_N_players:
source: You need to select players:
ru: вам нужно выбрать игроков:

# all_players_selected
source: Rally participants recruited
ru: Участники митинга набраны

# you_r_not_mission_commander
source: You are not the rally organiser!
ru: Вы не организатор митинга!

# all_voted_mission_team_confirmed
source: All voted, rally team approved.
ru: Все проголосовали, команда митинга одобрена.

# voters_confirmed
source: Voted Approved:
ru: Проголосовал ЗА:

# voters_against
source: Voted Against:
ru: Проголосовал ПРОТИВ:

# pls_admin_enter_start_command
source: Please enter /start command
ru: пожалуйста введите команду /start

# game_ended_agents_win
source: Game is over. The government has won!
ru: Игра завершена. Выиграло Правительство!

# mission_team_fail
source: The rally team has failed
ru: Команда митингующих провалилась

source: times in row
ru: раз(а) подряд

# you_r_voted
source: You are voted
ru: Вы проголосовали

source: voted:
ru: Всего проголосовало:

source: voted
ru: проголосовал(а)

# all_voted
source: Everyone voted
ru: Все проголосовали

# mission_failed
source: The rally fails
ru: Митинг провален

# mission_succeeded
source: The rally was a success
ru: Митинг прошел успешно

# poll_stat
source: Voting statistics
ru: Статистика голосования

source: Current situation
ru: Текущая ситуация

source: round
ru: раунд

# gov
source: government
ru: Правительство

# opp
source: opposition
ru: Оппозиция

# prosecutor_can_arrest_leader_opposition
source: The Prosecutor can arrest one of the participants in the game and if he arrests the Leader of the Opposition, the Government team wins the game!
ru: Прокурор может арестовать одного из участников игры и если арестует Лидера Оппозиции - команда Правительства побеждает в этой игре!

# you_r_not_voters
source: You cannot vote
ru: Вы не можете голосовать

# you_not_prosecutor
source: You are not prosecutor
ru: Вы не Прокурор

# prosecutor_arrest
source: Prosecutor arrested:
ru: Прокурор арестовал:

source: selected language
ru: Выберите язык

source: Reply not found
ru: Ответ не найден
